2311102034_Rizal-Dwi-Anggoro/JerseyStore-2311102034/app/Models/JerseyModel.php

    public function countAktif(): int
    {
        return $this->where('status', 'Aktif')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `jerseys`
WHERE `status` = 'Aktif'

    public function totalStok(): int
    {
        $row = $this->db->table($this->table)->selectSum('stok')->get()->getRow();
---
SELECT SUM(`stok`) AS `stok`
FROM `jerseys`

    public function getLigaStats(): array
    {
        return $this->db->table($this->table)
            ->select('liga, COUNT(*) as jumlah')
            ->groupBy('liga')
            ->orderBy('jumlah', 'DESC')
            ->get()
            ->getResult();
---
SELECT `liga`, COUNT(*) as jumlah
FROM `jerseys`
GROUP BY `liga`
ORDER BY `jumlah` DESC

    public function generateKode(): string
    {
        $row = $this->db->table($this->table)->selectMax('id')->get()->getRow();
---
SELECT MAX(`id`) AS `id`
FROM `jerseys`