2311102034_Rizal-Dwi-Anggoro/JerseyStore-2311102034/app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows` FROM `jerseys`
SELECT *
FROM `jerseys`
ORDER BY `id` DESC
 LIMIT 6
---
    public function index(): string
    {
        $model = new JerseyModel();

        $data = [
            'title'          => 'Dashboard',
            'activeMenu'     => 'dashboard',
            'totalJersey'    => $model->countAll(),
            'totalAktif'     => $model->countAktif(),
            'totalStok'      => $model->totalStok(),
            'ligaStats'      => $model->getLigaStats(),
            'jerseysTerbaru' => $model->orderBy('id', 'DESC')->findAll(6),