2311102034_Rizal-Dwi-Anggoro/JerseyStore-2311102034/app/Controllers/Jersey.php

    public function index(): string
    {
        $data = [
            'title'       => 'Data Jersey',
            'activeMenu'  => 'jersey',
            'total'       => $this->model->countAll(),
            'totalAktif'  => $this->model->countAktif(),
            'totalStok'   => $this->model->totalStok(),
        ];
---
SELECT *
FROM `jerseys`
SELECT COUNT(*) AS `numrows` FROM `jerseys`

    public function simpan(): \CodeIgniter\HTTP\RedirectResponse|string
    {
        // Validasi input
        $rules = $this->_validationRules();
        if (!$this->validate($rules)) {
            $data = [
                'title'      => 'Tambah Jersey',
                'activeMenu' => 'jersey',
                'autoKode'   => $this->request->getPost('kode'),
                'formAction' => base_url('jersey/simpan'),
                'mode'       => 'tambah',
                'jersey'     => (object)$this->request->getPost(),
                'errors'     => $this->validator->getErrors(),
            ];
            return view('layouts/header', $data)
                 . view('jersey/form', $data)
                 . view('layouts/footer');
        }

        $this->model->skipValidation(true)->insert($this->_getFormData());
---
INSERT INTO `jerseys` (`kode`, `nama`, `klub`, `liga`, `musim`, `ukuran`, `jenis`, `harga`, `stok`, `deskripsi`, `status`, `created_at`, `updated_at`) VALUES ('JRS-012', 'Jersey Manchester United 2007/2008', 'Manchester United', 'Premier League', '2007/2008', 'M', 'Home', 1300000, 2, 'No Minus', 'Aktif', '2026-03-29 17:42:53', '2026-03-29 17:42:53')

    public function update(int $id): \CodeIgniter\HTTP\RedirectResponse|string
    {
        $jersey = $this->model->find($id);
        if (!$jersey) {
            return redirect()->to(base_url('jersey'))->with('error', 'Data tidak ditemukan!');
        }

        $rules = $this->_validationRules();
        if (!$this->validate($rules)) {
            $data = [
                'title'      => 'Edit Jersey',
                'activeMenu' => 'jersey',
                'autoKode'   => $this->request->getPost('kode'),
                'formAction' => base_url('jersey/update/' . $id),
                'mode'       => 'edit',
                'jersey'     => (object)array_merge((array)$jersey, $this->request->getPost()),
                'errors'     => $this->validator->getErrors(),
            ];
            return view('layouts/header', $data)
                 . view('jersey/form', $data)
                 . view('layouts/footer');
        }

        $this->model->skipValidation(true)->update($id, $this->_getFormData());
---
UPDATE `jerseys` SET `kode` = 'JRS-012', `nama` = 'Jersey Manchester City 2007/2008', `klub` = 'Manchester City', `liga` = 'Premier League', `musim` = '2007/2008', `ukuran` = 'M', `jenis` = 'Home', `harga` = 1400000, `stok` = 3, `deskripsi` = 'No Minus', `status` = 'Aktif', `updated_at` = '2026-03-29 17:43:50'
WHERE `jerseys`.`id` IN (12)

    public function hapus(int $id): \CodeIgniter\HTTP\Response|\CodeIgniter\HTTP\RedirectResponse
    {
        $jersey = $this->model->find($id);

        if (!$jersey) {
            if ($this->request->isAJAX()) {
                return $this->response->setJSON(['status' => 'error', 'message' => 'Data tidak ditemukan!']);
            }
            return redirect()->to(base_url('jersey'))->with('error', 'Data tidak ditemukan!');
        }

        $this->model->delete($id);
---
DELETE FROM `jerseys`
WHERE `id` IN (12)